{"<PAD>": 0, "<UNK>": 1, "Ba1": 2, "Ba2": 3, "Ba3": 4, "Ba4": 5, "Ba5": 6, "Ba6": 7, "Ba7": 8, "Ba8": 9, "Bb1": 10, "Bb2": 11, "Bb3": 12, "Bb4": 13, "Bb5": 14, "Bb6": 15, "Bb7": 16, "Bb8": 17, "Bc1": 18, "Bc2": 19, "Bc3": 20, "Bc4": 21, "Bc5": 22, "Bc6": 23, "Bc7": 24, "Bc8": 25, "Bd1": 26, "Bd2": 27, "Bd3": 28, "Bd4": 29, "Bd5": 30, "Bd6": 31, "Bd7": 32, "Bd8": 33, "Be1": 34, "Be2": 35, "Be3": 36, "Be4": 37, "Be5": 38, "Be6": 39, "Be7": 40, "Be8": 41, "Bf1": 42, "Bf2": 43, "Bf3": 44, "Bf4": 45, "Bf5": 46, "Bf6": 47, "Bf7": 48, "Bf8": 49, "Bg1": 50, "Bg2": 51, "Bg3": 52, "Bg4": 53, "Bg5": 54, "Bg6": 55, "Bg7": 56, "Bg8": 57, "Bh1": 58, "Bh2": 59, "Bh3": 60, "Bh4": 61, "Bh5": 62, "Bh6": 63, "Bh7": 64, "Bh8": 65, "Ka1": 66, "Ka2": 67, "Ka3": 68, "Ka4": 69, "Ka5": 70, "Ka6": 71, "Ka7": 72, "Ka8": 73, "Kb1": 74, "Kb2": 75, "Kb3": 76, "Kb4": 77, "Kb5": 78, "Kb6": 79, "Kb7": 80, "Kb8": 81, "Kc1": 82, "Kc2": 83, "Kc3": 84, "Kc4": 85, "Kc5": 86, "Kc6": 87, "Kc7": 88, "Kc8": 89, "Kd1": 90, "Kd2": 91, "Kd3": 92, "Kd4": 93, "Kd5": 94, "Kd6": 95, "Kd7": 96, "Kd8": 97, "Ke1": 98, "Ke2": 99, "Ke3": 100, "Ke4": 101, "Ke5": 102, "Ke6": 103, "Ke7": 104, "Ke8": 105, "Kf1": 106, "Kf2": 107, "Kf3": 108, "Kf4": 109, "Kf5": 110, "Kf6": 111, "Kf7": 112, "Kf8": 113, "Kg1": 114, "Kg2": 115, "Kg3": 116, "Kg4": 117, "Kg5": 118, "Kg6": 119, "Kg7": 120, "Kg8": 121, "Kh1": 122, "Kh2": 123, "Kh3": 124, "Kh4": 125, "Kh5": 126, "Kh6": 127, "Kh7": 128, "Kh8": 129, "Na1": 130, "Na2": 131, "Na3": 132, "Na4": 133, "Na5": 134, "Na6": 135, "Na7": 136, "Na8": 137, "Nb1": 138, "Nb2": 139, "Nb3": 140, "Nb4": 141, "Nb5": 142, "Nb6": 143, "Nb7": 144, "Nb8": 145, "Nc1": 146, "Nc2": 147, "Nc3": 148, "Nc4": 149, "Nc5": 150, "Nc6": 151, "Nc7": 152, "Nc8": 153, "Nd1": 154, "Nd2": 155, "Nd3": 156, "Nd4": 157, "Nd5": 158, "Nd6": 159, "Nd7": 160, "Nd8": 161, "Ne1": 162, "Ne2": 163, "Ne3": 164, "Ne4": 165, "Ne5": 166, "Ne6": 167, "Ne7": 168, "Ne8": 169, "Nf1": 170, "Nf2": 171, "Nf3": 172, "Nf4": 173, "Nf5": 174, "Nf6": 175, "Nf7": 176, "Nf8": 177, "Ng1": 178, "Ng2": 179, "Ng3": 180, "Ng4": 181, "Ng5": 182, "Ng6": 183, "Ng7": 184, "Ng8": 185, "Nh1": 186, "Nh2": 187, "Nh3": 188, "Nh4": 189, "Nh5": 190, "Nh6": 191, "Nh7": 192, "Nh8": 193, "O-O": 194, "O-O-O": 195, "Qa1": 196, "Qa2": 197, "Qa3": 198, "Qa4": 199, "Qa5": 200, "Qa6": 201, "Qa7": 202, "Qa8": 203, "Qb1": 204, "Qb2": 205, "Qb3": 206, "Qb4": 207, "Qb5": 208, "Qb6": 209, "Qb7": 210, "Qb8": 211, "Qc1": 212, "Qc2": 213, "Qc3": 214, "Qc4": 215, "Qc5": 216, "Qc6": 217, "Qc7": 218, "Qc8": 219, "Qd1": 220, "Qd2": 221, "Qd3": 222, "Qd4": 223, "Qd5": 224, "Qd6": 225, "Qd7": 226, "Qd8": 227, "Qe1": 228, "Qe2": 229, "Qe3": 230, "Qe4": 231, "Qe5": 232, "Qe6": 233, "Qe7": 234, "Qe8": 235, "Qf1": 236, "Qf2": 237, "Qf3": 238, "Qf4": 239, "Qf5": 240, "Qf6": 241, "Qf7": 242, "Qf8": 243, "Qg1": 244, "Qg2": 245, "Qg3": 246, "Qg4": 247, "Qg5": 248, "Qg6": 249, "Qg7": 250, "Qg8": 251, "Qh1": 252, "Qh2": 253, "Qh3": 254, "Qh4": 255, "Qh5": 256, "Qh6": 257, "Qh7": 258, "Qh8": 259, "Ra1": 260, "Ra2": 261, "Ra3": 262, "Ra4": 263, "Ra5": 264, "Ra6": 265, "Ra7": 266, "Ra8": 267, "Rb1": 268, "Rb2": 269, "Rb3": 270, "Rb4": 271, "Rb5": 272, "Rb6": 273, "Rb7": 274, "Rb8": 275, "Rc1": 276, "Rc2": 277, "Rc3": 278, "Rc4": 279, "Rc5": 280, "Rc6": 281, "Rc7": 282, "Rc8": 283, "Rd1": 284, "Rd2": 285, "Rd3": 286, "Rd4": 287, "Rd5": 288, "Rd6": 289, "Rd7": 290, "Rd8": 291, "Re1": 292, "Re2": 293, "Re3": 294, "Re4": 295, "Re5": 296, "Re6": 297, "Re7": 298, "Re8": 299, "Rf1": 300, "Rf2": 301, "Rf3": 302, "Rf4": 303, "Rf5": 304, "Rf6": 305, "Rf7": 306, "Rf8": 307, "Rg1": 308, "Rg2": 309, "Rg3": 310, "Rg4": 311, "Rg5": 312, "Rg6": 313, "Rg7": 314, "Rg8": 315, "Rh1": 316, "Rh2": 317, "Rh3": 318, "Rh4": 319, "Rh5": 320, "Rh6": 321, "Rh7": 322, "Rh8": 323, "a1=B": 324, "a1=N": 325, "a1=Q": 326, "a1=R": 327, "a2": 328, "a3": 329, "a4": 330, "a5": 331, "a6": 332, "a7": 333, "a8=B": 334, "a8=N": 335, "a8=Q": 336, "a8=R": 337, "b1=B": 338, "b1=N": 339, "b1=Q": 340, "b1=R": 341, "b2": 342, "b3": 343, "b4": 344, "b5": 345, "b6": 346, "b7": 347, "b8=B": 348, "b8=N": 349, "b8=Q": 350, "b8=R": 351, "c1=B": 352, "c1=N": 353, "c1=Q": 354, "c1=R": 355, "c2": 356, "c3": 357, "c4": 358, "c5": 359, "c6": 360, "c7": 361, "c8=B": 362, "c8=N": 363, "c8=Q": 364, "c8=R": 365, "d1=B": 366, "d1=N": 367, "d1=Q": 368, "d1=R": 369, "d2": 370, "d3": 371, "d4": 372, "d5": 373, "d6": 374, "d7": 375, "d8=B": 376, "d8=N": 377, "d8=Q": 378, "d8=R": 379, "e1=B": 380, "e1=N": 381, "e1=Q": 382, "e1=R": 383, "e2": 384, "e3": 385, "e4": 386, "e5": 387, "e6": 388, "e7": 389, "e8=B": 390, "e8=N": 391, "e8=Q": 392, "e8=R": 393, "f1=B": 394, "f1=N": 395, "f1=Q": 396, "f1=R": 397, "f2": 398, "f3": 399, "f4": 400, "f5": 401, "f6": 402, "f7": 403, "f8=B": 404, "f8=N": 405, "f8=Q": 406, "f8=R": 407, "g1=B": 408, "g1=N": 409, "g1=Q": 410, "g1=R": 411, "g2": 412, "g3": 413, "g4": 414, "g5": 415, "g6": 416, "g7": 417, "g8=B": 418, "g8=N": 419, "g8=Q": 420, "g8=R": 421, "h1=B": 422, "h1=N": 423, "h1=Q": 424, "h1=R": 425, "h2": 426, "h3": 427, "h4": 428, "h5": 429, "h6": 430, "h7": 431, "h8=B": 432, "h8=N": 433, "h8=Q": 434, "h8=R": 435}